Revit 2027 API
ParameterTypeId.FabricationPartWidthIn Property
 "Main Primary Width"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationPartWidthIn { get; }
Public Shared ReadOnly Property FabricationPartWidthIn As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationPartWidthIn {
	ForgeTypeId^ get ();
}
static member FabricationPartWidthIn : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace